{"id":"crosstalk","title":"Crosstalk: A Chat App","html":"<p></p>\n<meta published=\"08 Jun 2011\" />  \n<p>Not long ago there was a crazy rush of startups building group chat applications. Names like Beluga, Convore, Banter.ly, Group.me, Brizzly and others spring to mind. Other, more mature products like 37signals' Campfire and web-based IRC clients are also part of this suite.</p> \n<p>The space is crowded, and recently bubble-like in its growth. I think there are a multitude of reasons for this:</p> \n<ul> \n <li>Status updates have become the currency of social interaction thanks to Twitter and Facebook</li> \n <li>There is a real need for group communication that these products do not provide</li> \n <li>It is fairly easy to write a group chat app, and the point of distincion is all about UI</li> \n</ul> \n<p>As an experiment to test these three theories, <a href=\"http://themaninblue.com\">The Man in Blue</a> and I took a week to see if we could build such a group-chat application. We came up with Crosstalk after four days.</p> \n<p><a href=\"http://rethrick.com/images/xtalk-home.png\"> <img src=\"http://rethrick.com/images/xtalk-home.png\" style=\"width:400px; display: block; margin: 0 auto; border: 1px solid #777; padding: 2px;\" /> </a></p> \n<p><br /> <a href=\"http://rethrick.com/images/xtalk-room.png\"> <img src=\"http://rethrick.com/images/xtalk-room.png\" style=\"width:400px; display: block; margin: 0 auto; border: 1px solid #777; padding: 2px;\" /> </a></p> \n<p>We have no particular intention of making this a startup or a running service (for reasons obvious from above), so in light of that I am announcing the release of the code as open source to do with as you will:</p> \n<p><a href=\"http://github.com/dhanji/crosstalk\">http://github.com/dhanji/crosstalk</a></p> \n<h3>Events</h3> \n<p>To give ourselves a specific goal, we focused on realtime chat for events, and customized it for the excellent <a href=\"http://webstock.co.nz\">Webstock</a> conference in New Zealand. We hoped it would prove useful for session attendees to share instant reactions, links and photos.</p> \n<p> It proved to have mixed results, some sessions were good and others weak. We didn't promote the app at all beyond a tweet, so this may have been the cause. Also 4-days of coding are bound to leave one with a few bugs.</p> \n<h3>Technology</h3> \n<p>The server was written on Google Appengine/Java, and powered by <a href=\"http://sitebricks.org\">Sitebricks</a>. We used the Appengine Channel API for Comet support (Message Push to the browser) and the client was written in jQuery with a focus on HTML5 features.</p> \n<p>I am proud to say we managed to get nearly every feature we wanted done, though not all worked to satisfaction for various reasons, including some quirks of Appengine. Here's an overview:</p> \n<ul> \n <li>You sign in with a Twitter account over OAuth</li> \n <li>Adding <em>terms</em> to a room triggers a periodic fetch of tweets matching that term from the public timeline</li> \n <li>Attachments such as images can be dragged and dropped into the browser window</li> \n <li>Images, Video URLs, and even Amazon product links are expanded/snippeted inline using <a href=\"http://embed.ly\">embed.ly</a></li> \n <li>The right margin features an activity histogram for the life of the chatroom</li> \n</ul> \n<p>The disclaimer is that it's still very raw, but you should be able to build and deploy it on any Appengine account using:</p> \n<pre><code>mvn package\nappcfg.sh update src/main/webapp\n</code></pre> \n<div style=\"font-size: small;\">\n You will need \n <a href=\"http://maven.apache.org\">Maven 2.2.1</a> and the \n <a href=\"http://code.google.com/appengine/downloads.html\">Appengine Java SDK</a>\n</div> \n<p>Tweet me your thoughts.</p> \n<p><br /></p> \n<div style=\"font-size: small;\">\n Find me on \n <a href=\"http://twitter.com/dhanji\">twitter</a>\n</div>","postedOn":"08 Jun 2011"}