{"id":"olpc-thoughts","title":"Lifting the Third World","html":"<p></p>  \n<p>I often wonder about the vast disparity of wealth between people in western, developed countries and those in the third world (I dislike the euphemism <em>developing</em> country). I was born and grew up (mostly) in India which was in the latter group at the time, and may still be, depending on what measure you choose. During this period India went through a process of economic liberalization that transformed it from a quaint and curious cultural backwater to a modern economic goliath.</p> \n<p>This transformation has had a profound impact on the lives, condition and aspirations of all Indians. But I think the single most important change has been</p> \n<h3>One Laptop Per Child</h3> \n<p>Helping people in the third world has always been looked at as an activity of aid and succour by people in the west. This is an entirely occidental perspective. The One-laptop-per-child program is the quintessial example of this. Noble and visionary though it may be, it is rooted in a subtle condescension that embodies everything that I think is wrong with the attitude towards developing countries. The OLPC program, at its inception determined to be an affordable (~US$100) laptop with minimal functionality such that it could be distributed right across the spectrum of impoverished children, giving them access to basic internet connectivity, and some word processing and productivity apps to aid in learning. X years, X million in funding later, the OLPC is yet to deliver on its promise. First the laptops could not be made cheap enough, so they subsidized parts further and took on more funding. Then, there were many internal squabbles about exactly how the program ought to be run, culminating notably in the resignation of XXX. Beyond this, the OLPC runs a flavor of the Linux OS, customized completely to its own vision. You cannot install third-party programs on it easily, certainly none that are easily available to the majority of us. And by all accounts the device itself is sluggish and error-prone.</p> \n<p> As anyone who has read the Cathedral and the Bazaar knows, these are all the hallmarks of a Cathedral-born device. Created in the ivory tower of noble condescension, and given to the</p> \n<h3>End Condescension</h3> \n<p>I don't claim in any way that India is now a great</p> \n<p><br /></p> \n<div style=\"font-size: small;\">\n Find me on \n <a href=\"http://twitter.com/dhanji\">twitter</a>\n</div>","postedOn":"29 Jun 2011"}