{"id":"rethinking","title":"Rethinking Google Wave","html":"<p></p> \n<meta published=\"11 Sep 2012\" />  \n<p>Ok this will be my last post about Wave and all things related. I've wanted to get this off my chest for awhile, so here goes. Hopefully, reading it is as interesting to you as writing it was cathartic to me.</p> \n<h3>A seedling doubt</h3> \n<p>I remember a chilly Fall evening at Sweeney's rooftop bar in Sydney. This was at the height of Wave. The growth numbers were incredible, signups were happening faster than we could spin up capacity, and invites were filling up eBay auctions at a rate of knots.</p> \n<p>We sat around the table in silence, nursing our beers. Finally, one of my colleagues broke the silence with a sheepish grin, &quot;Maybe there is something to this Wave thing after all.&quot;</p> \n<p>I was thinking the same thing. Earlier, we had spent many such evenings railing against bad UI decisions, architectural choices and general process problems. We were in a pressure-cooker with unrealistic, mythic, startup-style deadlines, so it was natural to vent. But I had always felt this was more than venting, that behind each desperate argument was the pain of deep frustration. One that was born of an equally deep passion to see this thing we had dedicated the past year to succeed.</p> \n<p>But now there was a doubt in our minds. Numbers don't lie.</p> \n<h3>Technology vs. Product</h3> \n<p>To be sure not everyone felt this way. Only a handful of us gathered to drink after work, and a similar number vented such frustrations. It was the intersection of the two groups that sat around the table that evening.</p> \n<p>Some weeks later, I read a blog post that was being circulated around the team. Most press we got in those days was of the adulatory, sycophantic and over-hyped variety. Some of it was negative, but this was usually driven by some agenda; like the <a href=\"http://en.wikipedia.org/wiki/Ray_Ozzie\">creator of Lotus Notes</a> declaring in an epic fit of irony that &quot;Wave was <a href=\"http://tech.slashdot.org/story/09/06/09/198205/ray-ozzie-calls-google-wave-anti-web\">too complex</a>&quot;, so I learned to tune most of it out.</p> \n<p>This story was different however--try as I might, I can't locate it--but its essential thrust was as follows:</p> \n<p>The official description of Wave reads like a list of technology features, but it says nothing about the product. He went on to compare it to a Facebook press release, which was a succinct and clear description of what someone can get out of it (I think it was their events feature).</p> \n<p>This really hit home for me. It phrased in simple words what I had been feeling all along and I think tied together the threads of all those frustrations into a coherent problem statement. Others have called it a solution in search of a problem.</p> \n<h3>Skunkworks</h3> \n<p>Of course we now know that the numbers were not to last. After the initial tsunami of tire-kickers came and went, there was a barren wreck--but it was also more than this. Wave really appealed to some people, it certainly appealed to me, but why that was I could not really say. Perhaps it was the geek in me that liked the idea of individual keystrokes flying about the earth, browser-to-browser, in fractions of a second. Or that there was finally a simple way to capture all kinds of media in a simple, shared record (any Pinterest fans out there?). Or even the potential for a really snazzy web app, a long overdue follow up to Gmail's breakthrough effort years before.</p> \n<p>Whatever it was, the project had its own momentum and that was not going to change. I even started a <a href=\"http://code.google.com/p/google-wave-splash/\">skunkworks project</a> to try to fix some of the problems with the slow, unwieldy GWT client. At this time, I still thought that things were salvageable if we only got the user interface to be simple and fast. I roped in 4 colleagues including Wave's UX designer when no one was looking. When we demoed opening a 420-message conversation in under 300ms to the rest of the team (in IE6 no less!), we got some converts. The GWT client team started their own skunkworks in counter-response to speed up their own UI. They did a great job too (to be clear, I had previously worked on the original, slow, GWT client too).</p> \n<p>By the time we pushed this through Google's careful release process however, it was time to draw the curtain down on Wave itself. The executive team was not really interested in a second go.</p> \n<h3>Rethinking things</h3> \n<p>But in hindsight, Im not sure making a faster or simpler client would have bought us all that much. The problems ran deeper, as that blogger had so succinctly identified--there was a looming question about the product itself. In that vein, I have been thinking about what Wave would look like if it were run again as a startup in earnest. That is, one without legions of engineers and product designers, and without the leviathan Google launchpad to spring from.</p> \n<p>What wave was good for in the end was working on a topic with a group. Generally the model worked best as follows:</p> \n<ul> \n <li>A single &quot;presenter&quot; of a topic puts out a thesis in the first post</li> \n <li>N responders comment below or make minor edits to the post for marginal improvements</li> \n <li>Each topic has an ephemeral lifespan like any normal forum thread</li> \n</ul> \n<p>What use case fits this really well? There are probably a number that come to mind, but my pick would be Mailing Lists, for example a Google Group used by an open source project. The current state of the art here is severely lacking:</p> \n<ul> \n <li>It is stuck in the email era of interactivity</li> \n <li>Spam is an enormous problem (jQuery <a href=\"http://forum.jquery.com/topic/moving-away-from-google-groups-to-forums\">left Google Groups</a>)</li> \n <li>Poor support for rich media, extensions, and so on.</li> \n</ul> \n<p>When I originally thought this up, I started by limiting logins to Twitter accounts (now you would choose something more developer friendly). This has a number of benefits, the main one being that you eliminate spam almost instantly. Also Twitter users overlap well with our target audience--active open source contributors and users. These people are generally avid early adopters and strong evangelists for products they like.</p> \n<p>Using something like Twitter for logins also has little advantages like a better coverage of avatars and an easy-access viral bullhorn for announcements. </p> \n<h3>Minimum Viable Product</h3> \n<p>In this spirit I made a few mockups (click to expand):</p> \n<p><a href=\"http://rethrick.com/images/wave/main.png\"> <img src=\"http://rethrick.com/images/wave/main.png\" style=\"width:500px; display: block; margin: 0 auto; border: 1px solid #777; padding: 2px;\" /> </a></p> \n<p>This is a simple list of discussion threads belonging to a group, in this case for the <a href=\"http://sitebricks.org\">Sitebricks project</a>. It is nice and clean, and it presents most of the information you need in a forum. Newer discussions rise to the top, and older ones fall away into an archive. The app deliberately shows only a limited number as I think the signal-to-noise ratio of a mailing list has a dramatic falloff.</p> \n<p>The detailed view of a single discussion is also modernized but presents the main topic clearly.</p> \n<p><a href=\"http://rethrick.com/images/wave/thread.png\"> <img src=\"http://rethrick.com/images/wave/thread.png\" style=\"width:500px; display: block; margin: 0 auto; border: 1px solid #777; padding: 2px;\" /> </a></p> \n<p>Here we have concurrently-editable rich text (that famous Wave OT technology) that forms the root of the discussion. While I think there is value in anyone being able to annotate the text of the first post, I don't agree with Wave's freeform tree-reply model. Follow up replies and comments go below, in a simple linear flow:</p> \n<p><a href=\"http://rethrick.com/images/wave/reply.png\"> <img src=\"http://rethrick.com/images/wave/reply.png\" style=\"width:500px; display: block; margin: 0 auto; border: 1px solid #777; padding: 2px;\" /> </a></p> \n<p>Next, a simple analog of Twitter's asymmetric follow model makes it easy to express interest in a single thread, an entire group, or a person across groups:</p> \n<p><a href=\"http://rethrick.com/images/wave/following.png\"> <img src=\"http://rethrick.com/images/wave/following.png\" style=\"width:500px; display: block; margin: 0 auto; border: 1px solid #777; padding: 2px;\" /> </a></p> \n<p>This is not dissimilar to &quot;watched&quot; threads in some older forum apps. However I find the toggle button being quick and responsive, lets you jump in and out of interest in a topic nicely. Replies to public threads come back at you via @mentions on Twitter, or if you've elected as an email notification, but all the engagement happens on the site.</p> \n<p>You can even implement ACLs this way. Also you can do inventive things like restricting edit access or comment access to your social graph on Twitter. One can imagine expert groups being run this way, quite effectively.</p> \n<h3>Conclusion</h3> \n<p>Getting one or two high-profile open source projects to use the app would be a fantastic way to get grass-roots usage going. Related projects would soon follow giving you coveted viral growth (e.g. jQuery + plugins). And there'd be a ton of daily, real-world usage to measure and learn from. These kinds of users are quite vocal and will tell you exactly where you need to improve, and will bring with them a devoted user community.</p> \n<p>Furthermore, I'd follow Github's wonderful example of giving away all public groups for free and charging a modest sum for private groups and discussions as a means of income.</p> \n<p><a href=\"http://rethrick.com/images/wave/private.png\"> <img src=\"http://rethrick.com/images/wave/private.png\" style=\"width:500px; display: block; margin: 0 auto; border: 1px solid #777; padding: 2px;\" /> </a></p> \n<p>Finally, there is a lot of scope beyond this. The set of Mailing List users (although this set is very large--Google Groups itself accounts for millions of users) is only a starting point, but a good starting point at that. If successful, working your way to the next great use case ought to be natural and smooth. You can imagine everything from planning an event, to working on group assignments, to live-blogging the next iProduct happening on this platform.</p> \n<p>Wave attempted to be a great many things, but it attempted them all at once. If it started instead with just one and mastered it thoroughly, perhaps it would have earned the rest.</p> \n<p><br /></p> \n<div style=\"font-size: small;\">\n Find me on \n <a href=\"http://twitter.com/dhanji\">twitter</a>\n</div>","postedOn":"11 Sep 2012"}