{"id":"skeu-ios","title":"In defense of skeuomorphic design in iOS","html":"<p></p>\n<meta published=\"13 Aug 2012\" />  \n<blockquote>\n  (Skeuomorphism) A skeuomorph, or skeuomorphism is a derivative object which retains ornamental design cues to a structure that was necessary in the original. \n</blockquote> \n<p>If you run a search for &quot;skeuomorphism apple&quot; on Google you come up against a sheer wall of anger, frustration and contempt from all quarters of the design intelligentsia toward Apple. The Cardinal Sin that they're all railing against is use of skeuomorphic design elements in iOS applications. In other words, design elements that are there to resemble real world metaphors but that serve no functional purpose. For example, torn paper edges in the <a href=\"http://www.gearsoftech.com/wordpress/wp-content/uploads/2012/06/facebook_calendar_events_ios6.jpg\">Calendar</a> app, or the twine-bound spine of the <a href=\"http://www.digitalforreallife.com/wp-content/uploads/2012/06/iOS-Address-Book.png\">Address Book</a>. </p> \n<p>Most of the rants I've read go into tailspins about how awful this is, and how disappointing it is to receive something like this from Apple, who are known for taste and design. The specific criticism seems to fall into a couple of broad categories.</p> \n<ul> \n <li>It is inconsistent across apps</li> \n <li>It serves no functional purpose</li> \n</ul> \n<p>I don't really buy either of these reasons, here's why.</p> \n<h3>Inconsistency</h3> \n<p>The whole point of a platform like iOS is that each app is its own silo, working and fulfilling a (sometimes stretched) metaphor to something in the real world that has been automated (In the case of an address book or calendar, the metaphor doesn't require much of a stretch). Even an app like Messages is pretty simple to describe in terms of short conversational exchanges. As such the interface design of each of these apps is really about the <strong>metaphor</strong> and not about the platform.</p> \n<p>What you want to be consistent across apps is the mode of interaction, not the metaphor itself. If buttons, toolbars and sliders remain the same between my Address Book and my note-taking app, then I don't have to learn new gestures or controls and the consistency of the platform pays off. But what benefit is there to making Address Book <em>look</em> more like Evernote? Or for <a href=\"http://itunes.apple.com/au/app/things-for-ipad/id364365411?mt=8\">Things</a> to look more like Reminders?</p> \n<p>If anything I want my apps to look different so I have a natural context switch into the task I'm interested in doing. The visual familiarity of an app is closely tied to its purpose and helps me recall what I was doing with it last.</p> \n<p>I think the discontentment perhaps comes from the early days of Mac, where a consistent look was emphasized quite strongly (remember brushed metal?). It made somewhat more sense in that context because you could see multiple apps open at the same time, and switching between them was instant and seamless. In as constrained an environment as an iPhone or iPad, the app takes up all the room and switching is a distinct, deliberate, multiple step operation.</p> \n<p>At best, the requirement for consistent look and feel is a weak argument.</p> \n<h3>No functional purpose</h3> \n<p>It may seem tautological to say this, but really, the answer to this argument is in the definition itself. These interface elements are <em>ornamental by design</em>. They don't serve a functional purpose just as a desktop wallpaper of the Milky Way does not in any way serve to enchance usability beyond a plain gray background.</p> \n<p>They serve, however, to add elements of style and distinction. And more than that to give you a sense of familiarity--in a sense to bring the metaphor closer by reminding you of facets of real world address books, calendars and notebooks.</p> \n<p>What everyone seems really mad about is that this just <em>doesn't look good</em>. I'm no designer but I disagree with the absolutism of this stance. While I concede that these things are a matter of taste, and one nominally looks to the bright lights of an industry for direction on matters of taste--in this case I think they're wrong.</p> \n<p>Take two of my favorite apps: <a href=\"http://itunes.apple.com/au/app/penultimate/id354098826?mt=8\">Penultimate</a> and <a href=\"http://itunes.apple.com/au/app/things-for-ipad/id364365411?mt=8\">Things</a>. Both are fairly simple in what they do, and have close metaphors with the real world. Penultimate is a free form scratch pad, while Things is a task list. The former recalls the look and feel of a <a href=\"http://www.moleskineus.com/cahier-pocket-graph.html\">Moleskine notebook</a> and the latter, a ruled pad of checklists.</p> \n<p>Both these apps are wildly successful, beautiful to look at, enviably focused and functional. It'd be tragic if Penultimate dropped its graph-paper, cardboard and stapled spine for a more &quot;functional&quot; UI. (What would that even be? Yet another Web 2.0 spinoff with blue-gradient buttons?)</p> \n<p>By contrast, let's look at Windows 8: it is a well designed OS. Its UI is smooth, slick and very attractive. But at the same time there's something alien about it--like it was designed to be used in a sci-fi movie. It looks like those tablets that scientists are carrying around in Avatar or the GUI from <a href=\"http://www.youtube.com/watch?v=Btyv6yTF4UM&amp;feature=player_detailpage#t=110s\">Encom OS XII</a> in Tron Legacy. It just feels cold and sterile, lacking in the kind of humanity that Apple's efforts famously enjoin.</p> \n<p>This leads me to my thesis--maybe these apps can be made to look better, or more consistent, or maybe the complaints are only about Apple's stock apps (which I admit, fall short of Penultimate's aesthetic)--but there is a warmth to them that is familiar and inviting. If only for an extra moment, your eyes linger on the leather trim, the curled corner of a page or the comfort of warm fabric.</p> \n<p>It's these little touches of humanity that give Apple products their unrelenting appeal. </p> \n<h3>The Future</h3> \n<p>Having said all this however, I don't believe that Apple will continue with skeuomorphic designs very far into the future. The move to mobile, touch-driven devices presented a need for this style of design, to get users to think of the device in a novel and unexpected fashion. And to find a way to make gestures feel natural and intuitive. </p> \n<p>The subtle point here is that this isn't so much for brand new users (who have little baggage to shed anyway), but to the vast majority of people coming from the rigid, cumbersome model of a mouse-driven desktop UI. And most recently from the sluggish, patchwork interfaces of the Web 2.0 world. It is perhaps not surprising then, that it is this group that is most vocal in their objections. </p> \n<p>But iOS devices are already ubiquitous. Soon they will be entrenched, with the majority of users on their second or third generation device and with all the comfort and familiarity of past experience. Apps will develop and evolve the aesthetic, going past the need for simple (and obvious) touch metaphors into new, uncharted territory. And I'm excited to see what that brings.</p> \n<p><br /></p> \n<div style=\"font-size: small;\">\n PS: I realize that one objection many of you will have is that Mac OS copies these designs too--to that I say yes, the operative word is &quot;copy&quot;\n</div> \n<p><br /></p> \n<div style=\"font-size: small;\">\n Find me on \n <a href=\"http://twitter.com/dhanji\">twitter</a>\n</div>","postedOn":"13 Aug 2012"}